sukretniy/tinySA/NANOVNA_STM32_F303/board.h
/*
    ChibiOS - Copyright (C) 2006..2015 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

#ifndef _BOARD_H_
#define _BOARD_H_

/*
 * Setup for the Strawberry Linux STbee
 */

/*
 * Board identifier.
 */
#define BOARD_NANOVNA_STM32_F303
#define BOARD_NAME              "tinySA ULTRA"

#include <stm32f303xc.h>
//#include "..\nanovna.h"
/*
 * Board frequencies.
 */
#define STM32_LSECLK            32768
#define STM32_HSECLK            8000000

//#define STM32_HSE_BYPASS

/*
 * MCU type, supported types are defined in ./os/hal/platforms/hal_lld.h.
 */
#define STM32F303xC

//#define STM32_HSE_BYPASS

#define STM32F303xC_SYSTEM_MEMORY 0x1FFFD800
#define BOOT_FROM_SYTEM_MEMORY_MAGIC_ADDRESS 0x20009FF0
#define BOOT_FROM_SYTEM_MEMORY_MAGIC 0xDEADBEEF
//#define SYSTEM_BOOT_MSP *(uint32_t *)0  // 0x20001258
#define SYSTEM_BOOT_MSP 0x20001258

/*
 * IO pins assignments
 */

/* on-board */

#if  1                                                      // Set to 1 to build for prototype HW
#define TINYSA4_PROTO
#define GPIO_LED                0
#define LINE_LED                PAL_LINE(GPIOA,GPIO_LED)
#define GPIOA_LEVER1            1
#define GPIOA_PUSH              2
#define GPIOA_LEVER2            3
#define GPIO_SD_DAT2            4
#define LINE_SD_DAT2            PAL_LINE(GPIOA,GPIO_SD_DAT2)
#define GPIOA_DAC2              5
#define GPIOA_XP                6
#define GPIOA_YP                7
#define GPIO_LNA                8
#define LINE_LNA                PAL_LINE(GPIOA, GPIO_LNA)
#define GPIO_UART_TX            9
#define GPIO_UART_TX_PORT       GPIOA
#define GPIO_UART_RX            10
#define GPIO_UART_RX_PORT       GPIOA
#define GPIOA_USB_DM            11
#define GPIOA_USB_DP            12
#define GPIOA_JTMS              13
#define GPIOA_JTCK              14
#define GPIO_PE_SEL             15
#define LINE_PE_SEL             PAL_LINE(GPIOA,GPIO_PE_SEL)

#define GPIOB_XN                0
#define GPIOB_YN                1
#define GPIO_LCD_RESET          2
#define GPIO_LCD_RESET_PORT     GPIOB
#define GPIOB_SPI_SCLK          3
#define GPIOB_SPI_MISO          4
#define GPIOB_SPI_MOSI          5
#define GPIO_LO_SEL             6
#define LINE_LO_SEL             PAL_LINE(GPIOB, GPIO_LO_SEL)
#define __NEW_SWITCHES__
#ifdef __NEW_SWITCHES__
#define GPIOB_SD_CD              12
#define GPIOB_RX_SDN             7
#else
#define GPIOB_SD_CD              7
#define GPIOB_RX_SDN             12
#endif
#define LINE_SD_CD              PAL_LINE(GPIOB, GPIOB_SD_CD)
#define LINE_RX_SDN             PAL_LINE(GPIOB, GPIOB_RX_SDN)
#define GPIO_RX_SEL             8
#define LINE_RX_SEL             PAL_LINE(GPIOB, GPIO_RX_SEL)
#define GPIO_RX_CTS             9
#define LINE_RX_CTS             PAL_LINE(GPIOB, GPIO_RX_CTS)
#define GPIO_LCD_CD             10
#define GPIO_LCD_CD_PORT        GPIOB
#define GPIO_LCD_CS             11
#define GPIO_LCD_CS_PORT        GPIOB
#define GPIO_PB13               13
#define LINE_PB13               PAL_LINE(GPIOB, GPIO_PB13)
#define GPIO_SCL               13
#define LINE_SCL               PAL_LINE(GPIOB, GPIO_PB13)
#define GPIO_PB14               14
#define LINE_PB14               PAL_LINE(GPIOB, GPIO_PB14)
#define GPIO_SDA              14
#define LINE_SDA               PAL_LINE(GPIOB, GPIO_PB14)
#define GPIO_ULTRA              15
#define LINE_ULTRA              PAL_LINE(GPIOB,GPIO_ULTRA)

#define GPIO_SD_CS              13
#define LINE_SD_CS              PAL_LINE(GPIOC, GPIO_SD_CS)


#define GPIOF_OSC_IN            0
#define GPIOF_OSC_OUT           1


/*
 * I/O ports initial setup, this configuration is established soon after reset
 * in the initialization code.
 * Please refer to the STM32 Reference Manual for details.
 */
#define PIN_MODE_INPUT(n)           (0U << ((n) * 2U))
#define PIN_MODE_OUTPUT(n)          (1U << ((n) * 2U))
#define PIN_MODE_ALTERNATE(n)       (2U << ((n) * 2U))
#define PIN_MODE_ANALOG(n)          (3U << ((n) * 2U))
#define PIN_ODR_LOW(n)              (0U << (n))
#define PIN_ODR_HIGH(n)             (1U << (n))
#define PIN_OTYPE_PUSHPULL(n)       (0U << (n))
#define PIN_OTYPE_OPENDRAIN(n)      (1U << (n))
#define PIN_OSPEED_2M(n)            (0U << ((n) * 2U))
#define PIN_OSPEED_25M(n)           (1U << ((n) * 2U))
#define PIN_OSPEED_50M(n)           (2U << ((n) * 2U))
#define PIN_OSPEED_100M(n)          (3U << ((n) * 2U))
#define PIN_PUPDR_FLOATING(n)       (0U << ((n) * 2U))
#define PIN_PUPDR_PULLUP(n)         (1U << ((n) * 2U))
#define PIN_PUPDR_PULLDOWN(n)       (2U << ((n) * 2U))
#define PIN_AFIO_AF(n, v)           ((v##U) << (((n) % 8U) * 4U))

/*
 * GPIOA setup:
 *
 * PA8  - MCO               (alternate 0).
 * PA11 - USB_DM                    (alternate 14).
 * PA12 - USB_DP                    (alternate 14).
 * PA13 - SWDIO                     (alternate 0).
 * PA14 - SWCLK                     (alternate 0).
 */
#define VAL_GPIOA_MODER             (PIN_MODE_ANALOG(0U) |           \
                                     PIN_MODE_INPUT(1U) |           \
                                     PIN_MODE_INPUT(2U) |           \
                                     PIN_MODE_INPUT(3U) |           \
                                     PIN_MODE_ANALOG(GPIO_SD_DAT2) |           \
                                     PIN_MODE_ANALOG(GPIOA_DAC2) |  \
                                     PIN_MODE_ANALOG(GPIOA_XP) |    \
                                     PIN_MODE_ANALOG(GPIOA_YP) |    \
                                     PIN_MODE_OUTPUT(8U) | \
                                     PIN_MODE_ALTERNATE(GPIO_UART_TX) |           \
                                     PIN_MODE_ALTERNATE(GPIO_UART_RX) | \
                                     PIN_MODE_ALTERNATE(GPIOA_USB_DM) |  \
                                     PIN_MODE_ALTERNATE(GPIOA_USB_DP) |  \
                                     PIN_MODE_ALTERNATE(GPIOA_JTMS) |    \
                                     PIN_MODE_ALTERNATE(GPIOA_JTCK) |    \
                                     PIN_MODE_OUTPUT(15))
#define VAL_GPIOA_OTYPER            (PIN_OTYPE_PUSHPULL(0U) |       \
                                     PIN_OTYPE_PUSHPULL(1U) |       \
                                     PIN_OTYPE_PUSHPULL(2U) |   \
                                     PIN_OTYPE_PUSHPULL(3U) |   \
                                     PIN_OTYPE_PUSHPULL(GPIO_SD_DAT2) |       \
                                     PIN_OTYPE_PUSHPULL(5U) |       \
                                     PIN_OTYPE_PUSHPULL(6U) |       \
                                     PIN_OTYPE_PUSHPULL(7U) |       \
                                     PIN_OTYPE_PUSHPULL(8U) |       \
                                     PIN_OTYPE_PUSHPULL(GPIO_UART_TX) |       \
                                     PIN_OTYPE_PUSHPULL(GPIO_UART_RX) | \
                                     PIN_OTYPE_PUSHPULL(GPIOA_USB_DM) |  \
                                     PIN_OTYPE_PUSHPULL(GPIOA_USB_DP) |  \
                                     PIN_OTYPE_PUSHPULL(GPIOA_JTMS) |      \
                                     PIN_OTYPE_PUSHPULL(GPIOA_JTCK) |      \
                                     PIN_OTYPE_PUSHPULL(15))
#define VAL_GPIOA_OSPEEDR           (PIN_OSPEED_2M(0) |          \
                                     PIN_OSPEED_2M(1) |          \
                                     PIN_OSPEED_2M(2) |       \
                                     PIN_OSPEED_2M(3) |       \
                                     PIN_OSPEED_2M(GPIO_SD_DAT2) |          \
                                     PIN_OSPEED_2M(5) |           \
                                     PIN_OSPEED_2M(6) |          \
                                     PIN_OSPEED_2M(7) |          \
                                     PIN_OSPEED_2M(8U) | \
                                     PIN_OSPEED_100M(GPIO_UART_TX) |          \
                                     PIN_OSPEED_100M(GPIO_UART_RX) |         \
                                     PIN_OSPEED_100M(GPIOA_USB_DM) |     \
                                     PIN_OSPEED_100M(GPIOA_USB_DP) |     \
                                     PIN_OSPEED_100M(GPIOA_JTMS) |         \
                                     PIN_OSPEED_100M(GPIOA_JTCK) |         \
                                     PIN_OSPEED_100M(15))
#define VAL_GPIOA_PUPDR             (PIN_PUPDR_FLOATING(0) | \
                                     PIN_PUPDR_PULLDOWN(1) | \
                                     PIN_PUPDR_PULLDOWN(2) | \
                                     PIN_PUPDR_PULLDOWN(3) | \
                                     PIN_PUPDR_FLOATING(GPIO_SD_DAT2) |         \
                                     PIN_PUPDR_FLOATING(5) |         \
                                     PIN_PUPDR_FLOATING(6) |         \
                                     PIN_PUPDR_FLOATING(7) |         \
                                     PIN_PUPDR_PULLUP(8U) | \
                                     PIN_PUPDR_FLOATING(GPIO_UART_TX) |         \
                                     PIN_PUPDR_FLOATING(GPIO_UART_RX) | \
                                     PIN_PUPDR_FLOATING(GPIOA_USB_DM) | \
                                     PIN_PUPDR_FLOATING(GPIOA_USB_DP) | \
                                     PIN_PUPDR_PULLDOWN(GPIOA_JTMS) |   \
                                     PIN_PUPDR_PULLDOWN(GPIOA_JTCK) |   \
                                     PIN_PUPDR_PULLUP(15))
#define VAL_GPIOA_ODR               (PIN_ODR_HIGH(0) |             \
                                     PIN_ODR_HIGH(1) |             \
                                     PIN_ODR_HIGH(2) |         \
                                     PIN_ODR_HIGH(3) |         \
                                     PIN_ODR_HIGH(GPIO_SD_DAT2) |             \
                                     PIN_ODR_LOW(5) |              \
                                     PIN_ODR_HIGH(6) |             \
                                     PIN_ODR_HIGH(7) |             \
                                     PIN_ODR_HIGH(8U) |     \
                                     PIN_ODR_LOW(GPIO_UART_TX) |             \
                                     PIN_ODR_LOW(GPIO_UART_RX) | \
                                     PIN_ODR_HIGH(GPIOA_USB_DM) |   \
                                     PIN_ODR_HIGH(GPIOA_USB_DP) |   \
                                     PIN_ODR_HIGH(GPIOA_JTMS) |     \
                                     PIN_ODR_HIGH(GPIOA_JTCK) |     \
                                     PIN_ODR_HIGH(15))
#define VAL_GPIOA_AFRL              (PIN_AFIO_AF(0, 0) |           \
                                     PIN_AFIO_AF(1, 0) |           \
                                     PIN_AFIO_AF(2, 0) |       \
                                     PIN_AFIO_AF(3, 0) |       \
                                     PIN_AFIO_AF(GPIO_SD_DAT2, 0) |           \
                                     PIN_AFIO_AF(5, 0) |           \
                                     PIN_AFIO_AF(6, 0) |           \
                                     PIN_AFIO_AF(7, 0))
#define VAL_GPIOA_AFRH              (PIN_AFIO_AF(8U, 0) |           \
                                     PIN_AFIO_AF(GPIO_UART_TX, 7) |           \
                                     PIN_AFIO_AF(GPIO_UART_RX, 7) |          \
                                     PIN_AFIO_AF(GPIOA_USB_DM, 14) |     \
                                     PIN_AFIO_AF(GPIOA_USB_DP, 14) |     \
                                     PIN_AFIO_AF(GPIOA_JTMS, 0) |          \
                                     PIN_AFIO_AF(GPIOA_JTCK, 0) |          \
                                     PIN_AFIO_AF(15, 0))

